artillery/load-test.yml
config:
  target: 'http://localhost:3000/shorten'
  phases:
    - duration: 600 # Run the test for 1 minutes
      arrivalRate: 100 # Simulate 100 requests per second
  payload:
    path: "random-urls.csv"
    fields:
      - "url"

scenarios:
  - flow:
      - post:
          url: "/"
          json:
            url: "{{ url }}"